In [4]:
import pandas as pd

In [5]:
def read_data():
    data = pd.read_csv("Downloads/cast.csv")
    return data

In [6]:
data = read_data()
print(data)

                                    title  year                         name  \
0                          Closet Monster  2015                     Buffy #1
1                         Suuri illusioni  1985                       Homo $
2                     Battle of the Sexes  2017                      $hutter
3                    Secret in Their Eyes  2015                      $hutter
4                              Steve Jobs  2015                      $hutter
...                                   ...   ...                          ...
3611207                           Foxtrot  1988            Lilja ??risd?ttir
3611208  Niceland (Population. 1.000.002)  2004    Sigr??ur J?na ??risd?ttir
3611209                         Skammdegi  1985           Dalla ??r?ard?ttir
3611210                      U.S.S.S.S...  2003  Krist?n Andrea ??r?ard?ttir
3611211                 Bye Bye Blue Bird  1999                 Rosa ? R?gvu

            type                character     n
0          actor                  Buffy 4   NaN
1          actor                   Guests  22.0
2          actor          Bobby Riggs Fan  10.0
3          actor          2002 Dodger Fan   NaN
4          actor  1988 Opera House Patron   NaN
...          ...                      ...   ...
3611207  actress                     D?ra  24.0
3611208  actress             Woman in Bus  26.0
3611209  actress            Hj?krunarkona   9.0
3611210  actress   Afgr.dama ? bens?nst??  17.0
3611211  actress        Pensionatv?rtinde   NaN

[3611212 rows x 6 columns]

In [8]:
data.head(10)

,title,year,name,type,character,n
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,NaN
1,Suuri illusioni,1985,Homo $,actor,Guests,22.0
2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN
5,Straight Outta Compton,2015,$hutter,actor,Club Patron,NaN
6,Straight Outta Compton,2015,$hutter,actor,Dopeman,NaN
7,For Thy Love 2,2009,Bee Moe $lim,actor,Thug 1,NaN
8,"Lapis, Ballpen at Diploma, a True to Life Journey",2014,Jori ' Danilo' Jurado Jr.,actor,Jaime (young),9.0
9,Desire (III),2014,Syaiful 'Ariffin,actor,Actor Playing Eteocles from 'Antigone',NaN

# Q1 How Many Movies are listed in the titles Dataframe?

In [11]:
# using count() function we can get all the count of films listed in titles
print(data['title'].count())

3611212

# Q2 What are the earliest two films listed in the titles dataframe?

In [16]:
## head(2) will give earliest two films listed
data.head(2)
## we can also use iloc to just get movie name
data.iloc[0:2,0]

0     Closet Monster
1    Suuri illusioni
Name: title, dtype: object

# Q3 How Many Movies Have the title "Hamlet"

In [24]:
Hamlet_count = (data['title']=='Hamlet').sum()
print(Hamlet_count)

313

# Q4 How Many movies are title "North by Northwest"

In [25]:
mov = (data['title']=='North by Northwest').sum()
print(mov)

112

# Q5 When was the First movie titled "Hamlet" made?

In [26]:
hamlet = data[data['title'] == 'Hamlet']
hamlet = hamlet.sort_values(by='year')
first_hamlet = hamlet.iloc[0]['year']
print("the first movie titled hamlet was released on :",first_hamlet)

the first movie titled hamlet was released on : 1910

# Q6 List all of the "Treasure Island" movies from earliest to the most recent.

In [12]:
ti = data[data['title'] == 'Treasure Island']
ti = ti.sort_values(by='year')
ti

,title,year,name,type,character,n
830114,Treasure Island,1918,Charles Gorman,actor,Prologue Player,NaN
840745,Treasure Island,1918,Joe Grant,actor,Undetermined child role,NaN
909157,Treasure Island,1918,Edwin Harley,actor,Prologue Player,NaN
3298306,Treasure Island,1918,Violet Radcliffe,actress,Long John Silver,3.0
1715014,Treasure Island,1918,Lloyd Perl,actor,Black Dog,4.0
...,...,...,...,...,...,...
2420089,Treasure Island,1999,Caveh Zahedi,actor,Harold,9.0
1637661,Treasure Island,1999,Nick Offerman,actor,Samuel,2.0
1375015,Treasure Island,1999,J.P. Manoux,actor,Officer Hughes,18.0
1797264,Treasure Island,1999,Victor Raider-Wexler,actor,Samowitz,10.0
307749,Treasure Island,1999,Bob Byington,actor,Thomas,12.0

# Q7 How many movies were made in the year 1950?

In [27]:
count1950 = len(data[data['year']==1950])
count1950

22006

# Q8 How many movies were made from 1950 through 1959?

In [28]:
count = len(data[(data['year'] >=1950) & (data['year']<=1959)])
count

210986

# Q9 In what years has a movie titled "Batman" been released?

In [35]:
mov = data[data['title'] == 'Batman']
mov = mov.sort_values(by = 'year')
mov

,title,year,name,type,character,n
95672,Batman,1943,Frank Austin,actor,Hotel Clerk,NaN
2368904,Batman,1943,Charles C. Wilson,actor,Police Captain Arnold,NaN
880219,Batman,1943,Karl Hackett,actor,Wallace,NaN
2355812,Batman,1943,Billy Wilkerson,actor,Steve [Ch. 8,NaN
1815153,Batman,1943,Joey Ray,actor,Henchman,NaN
...,...,...,...,...,...,...
1067346,Batman,1989,Jazzer Jeyes,actor,Napier Hood,32.0
987413,Batman,1989,William Hootkins,actor,Lt. Eckhardt,12.0
966816,Batman,1989,Pat Hingle,actor,Commissioner James Gordon,5.0
3345872,Batman,1989,Liza Ross,actress,Tourist Mom,45.0
3356826,Batman,1989,Rachel Ryan,actress,Corpse,NaN

# Q10 How many roles were there in the movie "Inception"?

In [42]:
roles = (data['title']=='Inception').sum()
roles

77

# Q11 How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [70]:
icpt = data[(data['title']=='Inception')&data['n'].isna()]
icpt_total = len(icpt)
print("the total movie INCEPTION which is not ranked by N value are:",icpt_total)

the total movie INCEPTION which is not ranked by N value are: 26

# Q12 But how many roles in the movie "Inception" did receive an "n" value?

In [77]:
icpt = data[(data['title']=='Inception')&(data['n']>=0)]
icpt_total = len(icpt)
print("the total movie INCEPTION which is not ranked by N value are:",icpt_total)

the total movie INCEPTION which is not ranked by N value are: 51

# Q13 Display the cast of "North by Northwest" in their correct "n" value order, ignoring roles that did not earn a numeric "n" value?

In [78]:
nbn = data[(data['title']=='North by Northwest')&(data['n']>=0)]
nbn_order = nbn.sort_values(by='n',ascending=False)
nbn_order

,title,year,name,type,character,n
1334726,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0
198496,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1454363,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
447893,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
2212083,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
642085,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
1746383,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
2357939,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1229083,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
1634552,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
2923056,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
343701,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3024085,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
1404704,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3361396,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
840374,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0

# Q14 Display the cast in "n" order ,of the 1972 films "Sleuth"?

In [76]:
cast = data[(data['title']=='Sleuth')&(data['year']==1972)]
order_cast = cast.sort_values(by = 'n',ascending = False)
order_cast

,title,year,name,type,character,n
1396572,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0
2619278,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1412647,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
360365,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
314691,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
1644328,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0

# Q15 Now display the entire cast in order, of the 2007 version of "Sleuth"

In [51]:
cast = data[(data['title']=='Sleuth')&(data['year']==2007)]
cast

          title  year                 name     type          character    n
250297   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
314692   Sleuth  2007        Michael Caine    actor             Andrew  1.0
360366   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
1246855  Sleuth  2007             Jude Law    actor               Milo  2.0
1741124  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
2619277  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3223502  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

# Q16 How many roles were credited in the silent 1921 version of "Hamlet"

In [68]:
roles = data[data['title']=='Hamlet']
roles1 = roles.sort_values(by='n')
roles1

          title  year              name     type              character    n
1615     Hamlet  1996        Riz Abbasi    actor  Attendant to Claudius  1.0
301167   Hamlet  1964    Richard Burton    actor                 Hamlet  1.0
1804123  Hamlet  2011      Bruce Ramsay    actor                 Hamlet  1.0
476236   Hamlet  1976     Quentin Crisp    actor               Polonius  1.0
1592118  Hamlet  1911        Alwin Neu?    actor                 Hamlet  1.0
...         ...   ...               ...      ...                    ...  ...
3109186  Hamlet  1964       Linda Marsh  actress                Ophelia  NaN
3303304  Hamlet  1996    Melanie Ramsay  actress             Prostitute  NaN
3317452  Hamlet  1987    Melanie Revell  actress               Gertrude  NaN
3322807  Hamlet  1913  Olive Richardson  actress           Player Queen  NaN
3479394  Hamlet  1964      Carol Teitel  actress                   Lady  NaN

[313 rows x 6 columns]

# Q17 How many roles were credited in Branagh's 1996 Hamlet?

In [65]:
mov = data[(data['title']=='Hamlet')& (data['name']=='Kenneth Branagh')]
mov = len(mov)
print("the roles were credited in Branagh's Hamlet was only",mov)
print(mov)

the roles were credited in Branagh's Hamlet was only 1
1

# Q18 How many "Hamlet" roles has been listed in all films credits through history?

In [67]:
hamlet = data[(data['year']<=2023)&(data['character']=='Hamlet')]
total_role = len(hamlet)
print(f"{total_role} character has been listed in all films through history of Hamlet")

91 character has been listed in all films through history of Hamlet

# Q19 How many people have played an "Ophelia"?

In [73]:
mov = data[data['title']=='Ophelia']
mov1 = mov['name'].unique()
mov1

array(['Daisy Ridley', 'Naomi Watts'], dtype=object)

# Q20 How many people have played a role called "The Dude"?

In [85]:
the_dude = (data['character'] =='The Dude').sum()
the_dude

18

# Q21 How many people have played a role called "the Stranger"?

In [86]:
the_stg = (data['character'] =='The Stranger').sum()
the_stg

208

# Q22 How many roles has Sidney Poitier played throughout his career?

In [89]:
roles = (data['name']=='Sidney Poitier').sum()
print("the total role he played throughout his career is :",roles)

the total role he played throughout his career is : 43

# Q23 How many roles has Judi Dench played?

In [96]:
roles = data[data['name']=='Judi Dench']['character'].unique()
roles1 = len(roles)
print("the total roles were played by judi dench was :",roles1)

the total roles were played by judi dench was : 46

# Q24 List the supporting roles (having n =2) played by Cary Grant in the year 1940s, in order by year.

In [60]:
 lyst = data[(data['name']=='Cary Grant')&(data['year']>=1940)&(data['year']<=1949)&(data['n']==2)]['n'].count()
print("supporting roles played by Cary Grant in the year 1940s was only",lyst)

supporting roles played by Cary Grant in the year 1940s was only 2

# Q25 List the leading roles that Cary Grant played in the 1940s in order by year.

In [7]:
roles = data[(data['name']=='Cary Grant')&(data['year']==1940)&(data['character'])]
roles1 = roles.sort_values(by='year')
roles1

,title,year,name,type,character,n
840353,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
840371,My Favorite Wife,1940,Cary Grant,actor,Nick,2.0
840397,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
840399,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0

# Q26 How many roles were available for actors in the 1950s?

In [20]:
roles = data[(data['year']>=1950)&(data['year']<=1959)&(data['type']=='actor')]
total_roles = roles['character'].count()
print("The total roles available for actors in 1950s are :",total_roles)

The total roles available for actors in 1950s are : 154727

# Q27 How many roles were available for actresses in the 1950s?

In [21]:
roles = data[(data['year']>=1950)&(data['year']<=1959)&(data['type']=='actress')]
total_roles = roles['character'].count()
print("The total roles available for actress in 1950s are :",total_roles)

The total roles available for actress in 1950s are : 56259

# Q28 How many leading role(n=1) were available from the beginning of films history through 1980?

In [40]:
leading_role = data[(data['year']>=1894)&(data['year']<=1980)&(data['n']==1)]['n'].count() 
leading_role

63924

# Q29 How many non-leading role(n=1) were available from the beginning of films history through 1980?

In [80]:
role = data[(data['year']==1980)&(data['n']==1)]['n'].count()
print("the total roles available from the beginning of the film history was:",role)

the total roles available from the beginning of the film history was: 1143

# Q30 How many roles through 1980 were minor enough that they did not warrant a numeric "n" Rank?

In [38]:
minor_role = data[(data['year']>=1894)&(data['year']<=1980)& data['n'].isna()]
total_1980 = len(minor_role)
print(f"there are {total_1980} numbers of minor roles that did not got Rank")

there are 438086 numbers of minor roles that did not got Rank